Функция УпаковкиНоменклатуры(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураУпаковки.Упаковка КАК Упаковка
		|ИЗ
		|	Справочник.Номенклатура.Упаковки КАК НоменклатураУпаковки
		|ГДЕ
		|	НоменклатураУпаковки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Упаковки = Новый Массив;
	
	Если РезультатЗапроса.Пустой() Тогда
		Упаковки.Добавить(Справочники.УпаковкиНоменклатуры.БезУпаковки);
		Возврат Упаковки;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	Для Каждого Строка Из ВыборкаДетальныеЗаписи Цикл
		Упаковки.Добавить(Строка.Упаковка);
	КонецЦикла;
	
	Возврат Упаковки;

КонецФункции // УпаковкиНоменклатуры()
