#Область ПрограммныйИнтерфейс

Функция ИндексКартинкиКонтрагента(Тип, ПометкаУдаления = Ложь) Экспорт

	Если Тип = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Если Не ПометкаУдаления Тогда
			Возврат 1;
		Иначе 
			Возврат 3;
		КонецЕсли;
		
	КонецЕсли;
	
	ВызватьИсключение "Нельзя получить индекс картинки контрагента не для контрагента";
	
КонецФункции

Функция ЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции

Процедура ОбновитьИдентификаторыОбъектовМетоданных() Экспорт

	Для Каждого Роль Из Метаданные.Роли Цикл
		
		Если Не ЗначениеЗаполнено(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию(Роль.Имя)) Тогда
			
			НовыйИдентификатор = Справочники.ИдентификаторыОбъектовМетаданных.СоздатьЭлемент();
		    НовыйИдентификатор.Наименование = Роль.Имя;
			НовыйИдентификатор.Синоним = Роль.Синоним;
			НовыйИдентификатор.УИД = Новый УникальныйИдентификатор;
			НовыйИдентификатор.Тип = Перечисления.ТипыМетаданных.Роль;
			НовыйИдентификатор.Записать();
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция Модуль(Число) Экспорт

	Возврат ?(Число < 0, -Число, Число);
	
КонецФункции // Модуль()


#КонецОбласти