
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДанныеСтроки") Тогда
		
		Данные = Параметры.ДанныеСтроки;
		
		Объект.Дата 				= ТекущаяДата();
		Объект.Заказ				= Данные.Заказ;
		Объект.Номенклатура 		= Данные.Номенклатура;
		Объект.Партия				= Данные.Партия;
		Объект.Упаковка				= Данные.Упаковка;
		Объект.КоличествоУпаковок   = Данные.КоличествоУпаковок;
		Объект.ЕдиницаИзмерения		= Данные.ЕдиницаИзмерения;
		Объект.Количество			= Данные.Количество;
		Объект.СтоимостьЗаЕдиницу	= Данные.СтоимостьЗаЕдиницу;
		Объект.Сумма				= Данные.Сумма;
		
	КонецЕсли;
	//ТарураевЕ { 1.0.4 # 13.03.2023

	Если Объект.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.БезУпаковки") Тогда
		Элементы.КоличествоУпаковок.Доступность = Ложь;
		Элементы.Количество.Доступность = Истина;
	Иначе
		Элементы.Количество.Доступность = Ложь;
		Элементы.КоличествоУпаковок.Доступность = Истина;
	КонецЕсли;
	//ТарураевЕ } 1.0.4 # 13.03.2023

КонецПроцедуры

&НаКлиенте
Процедура Сторнировать(Команда)
	 ЭтотОбъект.Записать();	//ТарураевЕ { 1.0.4 # 13.03.2023

	 РаботаСДокументами.СторнироватьСтрокуЗаказа(Объект.Ссылка, Объект.Заказ, Объект.Номенклатура);

	 ЭтотОбъект.Закрыть();	//ТарураевЕ  1.0.4 # 13.03.2023
КонецПроцедуры

//ТарураевЕ { 1.0.4 # 13.03.2023
&НаКлиенте
Процедура СтоимостьЗаЕдиницуПриИзменении(Элемент)
	Объект.Сумма = Объект.СтоимостьЗаЕдиницу * Объект.КоличествоУпаковок;	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	Объект.СтоимостьЗаЕдиницу = Объект.Сумма / Объект.КоличествоУпаковок;
КонецПроцедуры
 &НаКлиенте
Процедура ВыполнитьПересчет()

	
	Если Объект.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.БезУпаковки") Тогда    	
		Объект.КоличествоУпаковок = Объект.Количество;                                                      	
	Иначе                                                                                                   	
		КратностьУпаковки = ОбщегоНазначенияСервер.ЗначениеРеквизита(Объект.Упаковка, "Кратность");
		Объект.Количество = Объект.КоличествоУпаковок * КратностьУпаковки;	                                	
	КонецЕсли;

КонецПроцедуры // ВыполнитьПересчёт(
&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	Объект.Сумма = Объект.СтоимостьЗаЕдиницу * Объект.КоличествоУпаковок;	
	ВыполнитьПересчет();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)   //тар
	Объект.КоличествоУпаковок = Объект.Количество;
	Объект.Сумма = Объект.СтоимостьЗаЕдиницу * Объект.КоличествоУпаковок;	
КонецПроцедуры
//ТарураевЕ } 1.0.4 # 13.03.2023