#Область ПрограммныйИнтерфейс

Процедура ОбновитьРолиПользователя(ПользовательСсылка, ГруппаДоступаСсылка) Экспорт

	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
													ПользовательСсылка.УникальныйИднтификаторПользователя);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступаРоли.Ссылка КАК Ссылка,
		|	ГруппыДоступаРоли.Роль КАК Роль
		|ИЗ
		|	Справочник.ГруппыДоступа.Роли КАК ГруппыДоступаРоли
		|ГДЕ
		|	ГруппыДоступаРоли.Ссылка = &ГруппаДоступа";
	
	Запрос.УстановитьПараметр("ГруппаДоступа", ГруппаДоступаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить();
	
	Для каждого СтрокаРезультата Из Результат Цикл
		
		ОбъектМетаданныхРоль = Метаданные.Роли.Найти(СтрокаРезультата.Роль.Наименование);
		Если НЕ Пользователь.Роли.Содержит(ОбъектМетаданныхРоль) Тогда
			Пользователь.Роли.Добавить(ОбъектМетаданныхРоль);
		КонецЕсли;
	
	КонецЦикла;
	
	Пользователь.Записать();

КонецПроцедуры

Функция ПроверитьРоль(Роль) Экспорт

	Возврат РольДоступна("ПолныеПрава") ИЛИ РольДоступна(Роль);

КонецФункции // ПроверитьРоль()

#КонецОбласти