
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТЗИзмененийСторно = ТаблицаИзмененийСторно();
	
	// регистр Товары Приход
	Движения.Товары.Записывать = Истина;
	Движение = Движения.Товары.Добавить();
	Если ТЗИзмененийСторно.ДельтаКоличество > 0 Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	Движение.ВидДвиженияПланФакт = Перечисления.ВидыДвиженияПланФакт.План;
	Движение.Период = ОбщегоНазначенияСервер.ЗначениеРеквизита(Заказ, "ПлановаяДатаПоставки");
	Движение.Номенклатура = Номенклатура;
	Движение.Партия = Партия;
	Движение.Упаковка = Упаковка;
	Движение.ЕдиницаИзмерения = ЕдиницаИзмерения;
	Движение.КоличествоУпаковок = ОбщегоНазначенияСервер.Модуль(ТЗИзмененийСторно.ДельтаКоличествоУпаковок);
	Движение.Количество = ОбщегоНазначенияСервер.Модуль(ТЗИзмененийСторно.ДельтаКоличество);
	Движение.МестоРазмещения = ОбщегоНазначенияСервер.ЗначениеРеквизита(Заказ, "СкладПоступления");

КонецПроцедуры

Функция ТаблицаИзмененийСторно()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СторнированиеСтрокиЗаказа.Упаковка КАК Упаковка,
		|	СторнированиеСтрокиЗаказа.КоличествоУпаковок КАК КоличествоУпаковок,
		|	СторнированиеСтрокиЗаказа.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СторнированиеСтрокиЗаказа.Количество КАК Количество,
		|	СторнированиеСтрокиЗаказа.СтоимостьЗаЕдиницу КАК СтоимостьЗаЕдиницу,
		|	СторнированиеСтрокиЗаказа.Сумма КАК Сумма,
		|	СторнированиеСтрокиЗаказа.КоличествоУпаковок - ЗаказНаЗакупкуСтрокиЗаказа.КоличествоУпаковок КАК ДельтаКоличествоУпаковок,
		|	СторнированиеСтрокиЗаказа.Количество - ЗаказНаЗакупкуСтрокиЗаказа.Количество КАК ДельтаКоличество,
		|	СторнированиеСтрокиЗаказа.СтоимостьЗаЕдиницу - ЗаказНаЗакупкуСтрокиЗаказа.СтоимостьЗаЕдиницу КАК ДельтаСуммаЗаЕдиницу,
		|	СторнированиеСтрокиЗаказа.Сумма - ЗаказНаЗакупкуСтрокиЗаказа.Сумма КАК ДельтаСумма
		|ИЗ
		|	Документ.СторнированиеСтрокиЗаказа КАК СторнированиеСтрокиЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаЗакупку.СтрокиЗаказа КАК ЗаказНаЗакупкуСтрокиЗаказа
		|		ПО СторнированиеСтрокиЗаказа.Заказ = ЗаказНаЗакупкуСтрокиЗаказа.Ссылка
		|			И СторнированиеСтрокиЗаказа.Номенклатура = ЗаказНаЗакупкуСтрокиЗаказа.Номенклатура
		|ГДЕ
		|	СторнированиеСтрокиЗаказа.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить()[0];

КонецФункции // ТаблицаИзмененийСторно()