//ТарураевЕ { 1.0.4 # 13.03.2023

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Договор = Договор;
	Движение.ВидДвиженияПланФакт = ВидДвиженияПланФакт;
	Движение.Сумма = Сумма;
	
КонецПроцедуры
//ТарураевЕ } 1.0.4 # 13.03.2023
