
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		// Документ создан программно
		УправлениеДоступностьюРедактированияРеквизитов.ЗаблокироватьРеквизиты(ЭтаФорма, Объект.Ссылка);
	Иначе
		Элементы.ДокументОснование.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитов(Команда)

	Подключаемый_РазрешитьРедактированиеРеквизитовНаСервере();

КонецПроцедуры // РазрешитьРедактированиеРеквизитов()

&НаСервере
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовНаСервере()

	УправлениеДоступностьюРедактированияРеквизитов.РазблокироватьРеквизиты(ЭтаФорма, Объект.Ссылка);

КонецПроцедуры // Подключаемый_РазрешитьРедактированиеРеквизитовНаСервере()

&НаКлиенте
Процедура Подключаемый_ЗавершитьРедактированиеРеквизитов()

	Подключаемый_ЗавершитьРедактированиеРеквизитовНаСервере();

КонецПроцедуры // Подключаемый_ЗавершитьРедактированиеРеквизитов()

&НаСервере
Процедура Подключаемый_ЗавершитьРедактированиеРеквизитовНаСервере()

	УправлениеДоступностьюРедактированияРеквизитов.ЗаблокироватьРеквизиты(ЭтаФорма, Объект.Ссылка);	

КонецПроцедуры // Подключаемый_ЗавершитьРедактированиеРеквизитовНаСервере()

