//#Область ОбработчикиКомандФормы

//&НаКлиенте
//Процедура УстановитьСтатусОжидается(Команда)
//	
//	НовыйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказов.Ожидается");
//	РаботаСДокументами.УстановитьСтатусДокумента(Объект.Ссылка, НовыйСтатус);	
//	ЭтотОбъект.Прочитать();
//	ОбновитьОтображениеДанных();
//	ОбновитьДоступностьЭлементовФормы();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьСтатусЗавершен(Команда)
//	
//    НовыйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказов.Завершен");
//	РаботаСДокументами.УстановитьСтатусДокумента(Объект.Ссылка, НовыйСтатус);	
//	ЭтотОбъект.Прочитать();//Тар
//	ОбновитьОтображениеДанных();
//	ОбновитьДоступностьЭлементовФормы();//Тар
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УстановитьСтатусОтменен(Команда)
//	
//	НовыйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказов.Отменен");
//	РаботаСДокументами.УстановитьСтатусДокумента(Объект.Ссылка, НовыйСтатус);	
//	ЭтотОбъект.Прочитать();//Тар
//	ОбновитьОтображениеДанных();
//	ОбновитьДоступностьЭлементовФормы();//Тар

//КонецПроцедуры

//&НаКлиенте
//Процедура СторнироватьСтроку(Команда)

//	ТекущиеДанные = Элементы.СтрокиЗаказа.ТекущиеДанные;
//	Если ТекущиеДанные = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ДанныеСтроки = Новый Структура("Номенклатура, Партия, Упаковка, КоличествоУпаковок, ЕдиницаИзмерения, Количество, СтоимостьЗаЕдиницу, Сумма, Заказ",
//									ТекущиеДанные.Номенклатура,
//									ТекущиеДанные.Партия,
//									ТекущиеДанные.Упаковка,
//									ТекущиеДанные.КоличествоУпаковок,
//									ТекущиеДанные.ЕдиницаИзмерения,
//									ТекущиеДанные.Количество,
//									ТекущиеДанные.СтоимостьЗаЕдиницу,
//									ТекущиеДанные.Сумма,
//									Объект.Ссылка);
//									
//	ПараметрыФормы = Новый Структура("ДанныеСтроки", ДанныеСтроки);
//	ОткрытьФорму("Документ.СторнированиеСтрокиЗаказа.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры
//#КонецОбласти
