Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(УникальныйИднтификаторПользователя)
		ИЛИ ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УникальныйИднтификаторПользователя) = Неопределено Тогда
		
			// Создать пользователия
			Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
			Пользователь.Имя = Наименование;
			Пользователь.ПоказыватьВСпискеВыбора = ПоказыватьВСпискеВыбора;
			Пользователь.Записать();
			
	КонецЕсли;
	УникальныйИднтификаторПользователя = Пользователь.УникальныйИдентификатор;	
	
КонецПроцедуры




