Функция РеквизитыНедоступныеДляРедактирования() Экспорт

	Реквизиты = Новый Массив;
	Реквизиты.Добавить("Дата");
	Реквизиты.Добавить("ДокументОснование");
	Реквизиты.Добавить("Номенклатура");
	Реквизиты.Добавить("Упаковка");
	Реквизиты.Добавить("КоличествоУпаковок");
	Реквизиты.Добавить("ЕдиницаИзмерения");
	Реквизиты.Добавить("Количество");
	Реквизиты.Добавить("МестоОтправления");
	Реквизиты.Добавить("МестоПолучения");
	Реквизиты.Добавить("ВидДвиженияПланФакт");
	
	Возврат Реквизиты;
	
КонецФункции // РеквизитыНедоступныеДляРедактирования()