
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Товары Приход
	Движения.Товары.Записывать = Истина;
	Движение = Движения.Товары.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.ВидДвиженияПланФакт = ВидДвиженияПланФакт;
	Движение.Период = Дата;
	Движение.Номенклатура = Номенклатура;
	Движение.Партия = Партия;
	Движение.Упаковка = Упаковка;
	Движение.ЕдиницаИзмерения = ЕдиницаИзмерения;
	Движение.МестоРазмещения = МестоПолучения;
	Движение.КоличествоУпаковок = КоличествоУпаковок;
	Движение.Количество = Количество;
	
	Если ВидДвиженияПланФакт = Перечисления.ВидыДвиженияПланФакт.Факт И ЗаписанПлан() Тогда
		
		Движение = Движения.Товары.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ВидДвиженияПланФакт = Перечисления.ВидыДвиженияПланФакт.План;
		Движение.Период = Дата;
		Движение.Номенклатура = Номенклатура;
		Движение.Партия = Партия;
		Движение.Упаковка = Упаковка;
		Движение.ЕдиницаИзмерения = ЕдиницаИзмерения;
		Движение.МестоРазмещения = МестоПолучения;
		Движение.КоличествоУпаковок = КоличествоУпаковок;
		Движение.Количество = Количество;	
		
	КонецЕсли;

КонецПроцедуры

Функция ЗаписанПлан()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Товары.Остатки КАК ТоварыОстатки
		|ГДЕ
		|	ТоварыОстатки.ВидДвиженияПланФакт = &ВидДвиженияПланФакт
		|	И ТоварыОстатки.Партия = &Партия
		|	И ТоварыОстатки.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("ВидДвиженияПланФакт", Перечисления.ВидыДвиженияПланФакт.План);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Партия", Партия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТЗОстатокПлан = РезультатЗапроса.Выгрузить();
	
	Для Каждого Строка Из ТЗОстатокПлан Цикл
		
		Если Строка.КоличествоОстаток > 0 Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции // ЗаписанПлан()

